import React from "react";
import Link from "next/link";
import Layout from "../components/Layout";
import useTranslation from "next-translate/useTranslation";
import { useRouter } from "next/router";
import Header from "../components/Header";
import Faq from "../components/pages/home/faq";
import Contact from "../components/pages/home/contact";
import Footer from "../components/footer";
import { useTypedSelector } from "../components/hooks/useTypeSelector";

const IndexPage = () => {
  let { t } = useTranslation("common");
  const router = useRouter();

  const { user } = useTypedSelector((state) => state.profile);

  console.log(router.locales, "ttttttttt");
  return (
    <Layout title="Home | Next.js + TypeScript Example">
      <div className="mainBg">
        <Header />
        <section className="mainSection">
          <div className="container">
            <div className="row align-items-center">
              <div className="col-md-6 ">
                <h1>
                  იპოვე ოთახის მეზობელი <br />
                  ხარჯების გაყოფის მიზნით
                </h1>
                <Link href={user ? "/search" : "/createProfile"}>
                  <a className="btn btn-primary ">იპოვე შენი ოთახის მეზობელი</a>
                </Link>
              </div>
              <div className="col-6 d-flex justify-content-end">
                {/* <img src="/imgs/banner.png" /> */}
              </div>
            </div>
          </div>
        </section>
      </div>
      <section className="stepsSection">
        <div className="container ">
          <h2>როგორ მუშაობს</h2>
          <div className="row mt-5 pt-5">
            <div className="col-md-3">
              <div className="stepsSection_card stepsSection_card_Wrapper">
                <div className="numberHint">
                  <svg
                    width="82"
                    height="41"
                    viewBox="0 0 82 41"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M82 41C82 30.1261 77.6804 19.6976 69.9914 12.0086C62.3024 4.31963 51.8739 8.20955e-07 41 0C30.1261 -8.20955e-07 19.6976 4.31963 12.0086 12.0086C4.31963 19.6976 1.64191e-06 30.1261 0 41L41 41H82Z"
                      fill="#F7F7F7"
                    />
                    <mask id="path-2-inside-1_0_1" fill="white">
                      <path d="M5.94032 41C5.421 41 4.99871 40.5789 5.01228 40.0598C5.12741 35.6527 6.05119 31.3014 7.74033 27.2234C9.5495 22.8557 12.2012 18.8871 15.5442 15.5442C18.8871 12.2013 22.8557 9.54951 27.2234 7.74034C31.5911 5.93117 36.2724 5 41 5C45.7276 5 50.4089 5.93117 54.7766 7.74034C59.1443 9.54951 63.1129 12.2012 66.4558 15.5442C69.7987 18.8871 72.4505 22.8557 74.2597 27.2234C75.9488 31.3014 76.8726 35.6527 76.9877 40.0598C77.0013 40.5789 76.579 41 76.0597 41V41C75.5403 41 75.1207 40.5789 75.1064 40.0598C74.9917 35.8997 74.1168 31.7929 72.5222 27.9431C70.8075 23.8035 68.2943 20.0423 65.126 16.874C61.9577 13.7057 58.1965 11.1925 54.0569 9.47784C49.9174 7.76318 45.4806 6.88066 41 6.88066C36.5194 6.88066 32.0826 7.76318 27.9431 9.47784C23.8035 11.1925 20.0422 13.7057 16.874 16.874C13.7057 20.0423 11.1925 23.8035 9.47783 27.9431C7.8832 31.7929 7.00829 35.8997 6.89361 40.0598C6.8793 40.5789 6.45965 41 5.94032 41V41Z" />
                    </mask>
                    <path
                      d="M5.94032 41C5.421 41 4.99871 40.5789 5.01228 40.0598C5.12741 35.6527 6.05119 31.3014 7.74033 27.2234C9.5495 22.8557 12.2012 18.8871 15.5442 15.5442C18.8871 12.2013 22.8557 9.54951 27.2234 7.74034C31.5911 5.93117 36.2724 5 41 5C45.7276 5 50.4089 5.93117 54.7766 7.74034C59.1443 9.54951 63.1129 12.2012 66.4558 15.5442C69.7987 18.8871 72.4505 22.8557 74.2597 27.2234C75.9488 31.3014 76.8726 35.6527 76.9877 40.0598C77.0013 40.5789 76.579 41 76.0597 41V41C75.5403 41 75.1207 40.5789 75.1064 40.0598C74.9917 35.8997 74.1168 31.7929 72.5222 27.9431C70.8075 23.8035 68.2943 20.0423 65.126 16.874C61.9577 13.7057 58.1965 11.1925 54.0569 9.47784C49.9174 7.76318 45.4806 6.88066 41 6.88066C36.5194 6.88066 32.0826 7.76318 27.9431 9.47784C23.8035 11.1925 20.0422 13.7057 16.874 16.874C13.7057 20.0423 11.1925 23.8035 9.47783 27.9431C7.8832 31.7929 7.00829 35.8997 6.89361 40.0598C6.8793 40.5789 6.45965 41 5.94032 41V41Z"
                      stroke="#5E666E"
                      strokeWidth="4"
                      mask="url(#path-2-inside-1_0_1)"
                    />
                  </svg>
                  <span>1</span>
                </div>
                <div className="img-wrapper">
                  <img src="/imgs/Frame.svg" />
                </div>
                <h3>სათაური</h3>
                <p>
                  შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და
                  ტიპოგრაფიული ნაწარმის შემქმნელებს, რეალურთან მაქსიმალურად
                  მიახლოებული
                </p>
              </div>
            </div>

            <div className="col-md-3 ">
              <div className="stepsSection_card mt-4 stepsSection_card_Wrapper">
                <div className="numberHint">
                  <svg
                    width="82"
                    height="41"
                    viewBox="0 0 82 41"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M82 41C82 30.1261 77.6804 19.6976 69.9914 12.0086C62.3024 4.31963 51.8739 8.20955e-07 41 0C30.1261 -8.20955e-07 19.6976 4.31963 12.0086 12.0086C4.31963 19.6976 1.64191e-06 30.1261 0 41L41 41H82Z"
                      fill="#F7F7F7"
                    />
                    <mask id="path-2-inside-1_0_1" fill="white">
                      <path d="M5.94032 41C5.421 41 4.99871 40.5789 5.01228 40.0598C5.12741 35.6527 6.05119 31.3014 7.74033 27.2234C9.5495 22.8557 12.2012 18.8871 15.5442 15.5442C18.8871 12.2013 22.8557 9.54951 27.2234 7.74034C31.5911 5.93117 36.2724 5 41 5C45.7276 5 50.4089 5.93117 54.7766 7.74034C59.1443 9.54951 63.1129 12.2012 66.4558 15.5442C69.7987 18.8871 72.4505 22.8557 74.2597 27.2234C75.9488 31.3014 76.8726 35.6527 76.9877 40.0598C77.0013 40.5789 76.579 41 76.0597 41V41C75.5403 41 75.1207 40.5789 75.1064 40.0598C74.9917 35.8997 74.1168 31.7929 72.5222 27.9431C70.8075 23.8035 68.2943 20.0423 65.126 16.874C61.9577 13.7057 58.1965 11.1925 54.0569 9.47784C49.9174 7.76318 45.4806 6.88066 41 6.88066C36.5194 6.88066 32.0826 7.76318 27.9431 9.47784C23.8035 11.1925 20.0422 13.7057 16.874 16.874C13.7057 20.0423 11.1925 23.8035 9.47783 27.9431C7.8832 31.7929 7.00829 35.8997 6.89361 40.0598C6.8793 40.5789 6.45965 41 5.94032 41V41Z" />
                    </mask>
                    <path
                      d="M5.94032 41C5.421 41 4.99871 40.5789 5.01228 40.0598C5.12741 35.6527 6.05119 31.3014 7.74033 27.2234C9.5495 22.8557 12.2012 18.8871 15.5442 15.5442C18.8871 12.2013 22.8557 9.54951 27.2234 7.74034C31.5911 5.93117 36.2724 5 41 5C45.7276 5 50.4089 5.93117 54.7766 7.74034C59.1443 9.54951 63.1129 12.2012 66.4558 15.5442C69.7987 18.8871 72.4505 22.8557 74.2597 27.2234C75.9488 31.3014 76.8726 35.6527 76.9877 40.0598C77.0013 40.5789 76.579 41 76.0597 41V41C75.5403 41 75.1207 40.5789 75.1064 40.0598C74.9917 35.8997 74.1168 31.7929 72.5222 27.9431C70.8075 23.8035 68.2943 20.0423 65.126 16.874C61.9577 13.7057 58.1965 11.1925 54.0569 9.47784C49.9174 7.76318 45.4806 6.88066 41 6.88066C36.5194 6.88066 32.0826 7.76318 27.9431 9.47784C23.8035 11.1925 20.0422 13.7057 16.874 16.874C13.7057 20.0423 11.1925 23.8035 9.47783 27.9431C7.8832 31.7929 7.00829 35.8997 6.89361 40.0598C6.8793 40.5789 6.45965 41 5.94032 41V41Z"
                      stroke="#5E666E"
                      strokeWidth="4"
                      mask="url(#path-2-inside-1_0_1)"
                    />
                  </svg>
                  <span>2</span>
                </div>
                <div className="img-wrapper">
                  <img src="/imgs/Frame.svg" />
                </div>
                <h3>სათაური</h3>
                <p>
                  შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და
                  ტიპოგრაფიული ნაწარმის შემქმნელებს, რეალურთან მაქსიმალურად
                  მიახლოებული
                </p>
              </div>
            </div>
            <div className="col-md-3">
              <div className="stepsSection_card stepsSection_card_Wrapper">
                <div className="numberHint">
                  <svg
                    width="82"
                    height="41"
                    viewBox="0 0 82 41"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M82 41C82 30.1261 77.6804 19.6976 69.9914 12.0086C62.3024 4.31963 51.8739 8.20955e-07 41 0C30.1261 -8.20955e-07 19.6976 4.31963 12.0086 12.0086C4.31963 19.6976 1.64191e-06 30.1261 0 41L41 41H82Z"
                      fill="#F7F7F7"
                    />
                    <mask id="path-2-inside-1_0_1" fill="white">
                      <path d="M5.94032 41C5.421 41 4.99871 40.5789 5.01228 40.0598C5.12741 35.6527 6.05119 31.3014 7.74033 27.2234C9.5495 22.8557 12.2012 18.8871 15.5442 15.5442C18.8871 12.2013 22.8557 9.54951 27.2234 7.74034C31.5911 5.93117 36.2724 5 41 5C45.7276 5 50.4089 5.93117 54.7766 7.74034C59.1443 9.54951 63.1129 12.2012 66.4558 15.5442C69.7987 18.8871 72.4505 22.8557 74.2597 27.2234C75.9488 31.3014 76.8726 35.6527 76.9877 40.0598C77.0013 40.5789 76.579 41 76.0597 41V41C75.5403 41 75.1207 40.5789 75.1064 40.0598C74.9917 35.8997 74.1168 31.7929 72.5222 27.9431C70.8075 23.8035 68.2943 20.0423 65.126 16.874C61.9577 13.7057 58.1965 11.1925 54.0569 9.47784C49.9174 7.76318 45.4806 6.88066 41 6.88066C36.5194 6.88066 32.0826 7.76318 27.9431 9.47784C23.8035 11.1925 20.0422 13.7057 16.874 16.874C13.7057 20.0423 11.1925 23.8035 9.47783 27.9431C7.8832 31.7929 7.00829 35.8997 6.89361 40.0598C6.8793 40.5789 6.45965 41 5.94032 41V41Z" />
                    </mask>
                    <path
                      d="M5.94032 41C5.421 41 4.99871 40.5789 5.01228 40.0598C5.12741 35.6527 6.05119 31.3014 7.74033 27.2234C9.5495 22.8557 12.2012 18.8871 15.5442 15.5442C18.8871 12.2013 22.8557 9.54951 27.2234 7.74034C31.5911 5.93117 36.2724 5 41 5C45.7276 5 50.4089 5.93117 54.7766 7.74034C59.1443 9.54951 63.1129 12.2012 66.4558 15.5442C69.7987 18.8871 72.4505 22.8557 74.2597 27.2234C75.9488 31.3014 76.8726 35.6527 76.9877 40.0598C77.0013 40.5789 76.579 41 76.0597 41V41C75.5403 41 75.1207 40.5789 75.1064 40.0598C74.9917 35.8997 74.1168 31.7929 72.5222 27.9431C70.8075 23.8035 68.2943 20.0423 65.126 16.874C61.9577 13.7057 58.1965 11.1925 54.0569 9.47784C49.9174 7.76318 45.4806 6.88066 41 6.88066C36.5194 6.88066 32.0826 7.76318 27.9431 9.47784C23.8035 11.1925 20.0422 13.7057 16.874 16.874C13.7057 20.0423 11.1925 23.8035 9.47783 27.9431C7.8832 31.7929 7.00829 35.8997 6.89361 40.0598C6.8793 40.5789 6.45965 41 5.94032 41V41Z"
                      stroke="#5E666E"
                      strokeWidth="4"
                      mask="url(#path-2-inside-1_0_1)"
                    />
                  </svg>
                  <span>3</span>
                </div>
                <div className="img-wrapper">
                  <img src="/imgs/Frame.svg" />
                </div>
                <h3>სათაური</h3>
                <p>
                  შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და
                  ტიპოგრაფიული ნაწარმის შემქმნელებს, რეალურთან მაქსიმალურად
                  მიახლოებული
                </p>
              </div>
            </div>
            <div className="col-md-3">
              <div className="stepsSection_card mt-4 stepsSection_card_Wrapper">
                <div className="numberHint">
                  <svg
                    width="82"
                    height="41"
                    viewBox="0 0 82 41"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M82 41C82 30.1261 77.6804 19.6976 69.9914 12.0086C62.3024 4.31963 51.8739 8.20955e-07 41 0C30.1261 -8.20955e-07 19.6976 4.31963 12.0086 12.0086C4.31963 19.6976 1.64191e-06 30.1261 0 41L41 41H82Z"
                      fill="#F7F7F7"
                    />
                    <mask id="path-2-inside-1_0_1" fill="white">
                      <path d="M5.94032 41C5.421 41 4.99871 40.5789 5.01228 40.0598C5.12741 35.6527 6.05119 31.3014 7.74033 27.2234C9.5495 22.8557 12.2012 18.8871 15.5442 15.5442C18.8871 12.2013 22.8557 9.54951 27.2234 7.74034C31.5911 5.93117 36.2724 5 41 5C45.7276 5 50.4089 5.93117 54.7766 7.74034C59.1443 9.54951 63.1129 12.2012 66.4558 15.5442C69.7987 18.8871 72.4505 22.8557 74.2597 27.2234C75.9488 31.3014 76.8726 35.6527 76.9877 40.0598C77.0013 40.5789 76.579 41 76.0597 41V41C75.5403 41 75.1207 40.5789 75.1064 40.0598C74.9917 35.8997 74.1168 31.7929 72.5222 27.9431C70.8075 23.8035 68.2943 20.0423 65.126 16.874C61.9577 13.7057 58.1965 11.1925 54.0569 9.47784C49.9174 7.76318 45.4806 6.88066 41 6.88066C36.5194 6.88066 32.0826 7.76318 27.9431 9.47784C23.8035 11.1925 20.0422 13.7057 16.874 16.874C13.7057 20.0423 11.1925 23.8035 9.47783 27.9431C7.8832 31.7929 7.00829 35.8997 6.89361 40.0598C6.8793 40.5789 6.45965 41 5.94032 41V41Z" />
                    </mask>
                    <path
                      d="M5.94032 41C5.421 41 4.99871 40.5789 5.01228 40.0598C5.12741 35.6527 6.05119 31.3014 7.74033 27.2234C9.5495 22.8557 12.2012 18.8871 15.5442 15.5442C18.8871 12.2013 22.8557 9.54951 27.2234 7.74034C31.5911 5.93117 36.2724 5 41 5C45.7276 5 50.4089 5.93117 54.7766 7.74034C59.1443 9.54951 63.1129 12.2012 66.4558 15.5442C69.7987 18.8871 72.4505 22.8557 74.2597 27.2234C75.9488 31.3014 76.8726 35.6527 76.9877 40.0598C77.0013 40.5789 76.579 41 76.0597 41V41C75.5403 41 75.1207 40.5789 75.1064 40.0598C74.9917 35.8997 74.1168 31.7929 72.5222 27.9431C70.8075 23.8035 68.2943 20.0423 65.126 16.874C61.9577 13.7057 58.1965 11.1925 54.0569 9.47784C49.9174 7.76318 45.4806 6.88066 41 6.88066C36.5194 6.88066 32.0826 7.76318 27.9431 9.47784C23.8035 11.1925 20.0422 13.7057 16.874 16.874C13.7057 20.0423 11.1925 23.8035 9.47783 27.9431C7.8832 31.7929 7.00829 35.8997 6.89361 40.0598C6.8793 40.5789 6.45965 41 5.94032 41V41Z"
                      stroke="#5E666E"
                      strokeWidth="4"
                      mask="url(#path-2-inside-1_0_1)"
                    />
                  </svg>
                  <span>4</span>
                </div>
                <div className="img-wrapper">
                  <img src="/imgs/Frame.svg" />
                </div>
                <h3>სათაური</h3>
                <p>
                  შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და
                  ტიპოგრაფიული ნაწარმის შემქმნელებს, რეალურთან მაქსიმალურად
                  მიახლოებული
                </p>
              </div>
            </div>
          </div>
        </div>
      </section>
      <section className="testimonialSection">
        <div className="container">
          <h2>რას ამბობენ ჩვენზე</h2>
          <div className="row">
            <div className="col-md-4">
              <div className="testimonialSection_card testimonialSection_card_wrapper">
                <div className="author">
                  <img src="/imgs/download.jpg" />
                  <div> სახელი გცარი</div>
                </div>
                <p>
                  შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და
                  ტიპოგრაფიული ნაწარმის შემქმნელებს, რეალურთან მაქსიმალურად
                  მიახლოებული შაბლონი წარუდგინონ შემფასებელს. ხშირადაა
                  შემთხვევა, როდესაც დიზაინის შესრულებისას საჩვენებელია, თუ
                  როგორი იქნება ტექსტის ბლოკი.
                </p>
              </div>
            </div>
            <div className="col-md-4">
              <div className="testimonialSection_card testimonialSection_card_wrapper">
                <div className="author">
                  <img src="/imgs/download.jpg" />
                  <div> სახელი გცარი</div>
                </div>
                <p>
                  შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და
                  ტიპოგრაფიული ნაწარმის შემქმნელებს, რეალურთან მაქსიმალურად
                  მიახლოებული შაბლონი წარუდგინონ შემფასებელს. ხშირადაა
                  შემთხვევა, როდესაც დიზაინის შესრულებისას საჩვენებელია, თუ
                  როგორი იქნება ტექსტის ბლოკი.
                </p>
              </div>
            </div>
            <div className="col-md-4">
              <div className="testimonialSection_card testimonialSection_card_wrapper">
                <div className="author">
                  <img src="/imgs/download.jpg" />
                  <div> სახელი გცარი</div>
                </div>
                <p>
                  შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და
                  ტიპოგრაფიული ნაწარმის შემქმნელებს, რეალურთან მაქსიმალურად
                  მიახლოებული შაბლონი წარუდგინონ შემფასებელს. ხშირადაა
                  შემთხვევა, როდესაც დიზაინის შესრულებისას საჩვენებელია, თუ
                  როგორი იქნება ტექსტის ბლოკი.
                </p>
              </div>
            </div>
          </div>
        </div>
      </section>
      <section className="faqSection">
        <div className="container">
          <h2>ხშირად დასმული შეკითხვები</h2>
          <div className="row">
            <Faq />
          </div>
        </div>
      </section>
      <section className="contactSection">
        <div className="container">
          <div className="row ">
            <div className="col-md-6 d-flex flex-column justify-content-center">
              <h2 className="pb-5">დაგვიკავშირდი</h2>
            </div>
            <div className="col-md-6">
              <Contact />
            </div>
          </div>
        </div>
      </section>
      <Footer />
      {/* <div style={{ marginTop: "600px" }}>
        <h1>Hello Next.js 👋</h1>
        <h2>{t("greeting")}</h2>
        <Link href={"/login"}>
          <a>login </a>
        </Link>
        <Link href={"/register"}>
          <a> register </a>
        </Link>
        <p>
          <Link href="/about">
            <a className="">About</a>
          </Link>

          <br />
          {router.locales.map((el) => {
            return (
              <Link key={el} href={router.asPath} locale={el}>
                <a>{el}</a>
              </Link>
            );
          })}
        </p>
      </div> */}
    </Layout>
  );
};

export default IndexPage;
